%3.3中已经计算出不同站点的车间时距
%以上行为例 x:22*各个站点次数-1
x=[x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23];
%b为站点经过次数
%计算样本方差1*22
var_s=var(x);
%计算均值1*22
e_s=mean(x);
%计算站点乘客平均延误1*22
yanwu=0.5*e_s(1,:)*(1+var_s(1,:)/e_s(1,:)/e_s(1,:));
%画图
% subplot(1,2,1);
a=2:1:22;
plot(a,yanwu);
xlabel('站点编号')
ylabel('站点乘客平均延误/min');
title('9月10日 嘉定104路公交 上行 站点乘客平均延误')
set(gca,'YLim',[0 15]);

subplot(1,2,2);

boxplot(data_x(2:6,:),'Labels', {'2', '3', '4', '5', '6', '7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23'});
set(gca,'YLim',[0 15]);
xlabel('站点编号')
ylabel('站点乘客平均延误/min');
title('9月10日 嘉定104路公交 下行 站点乘客平均延误')


%%从这里开始
[num,text,raw]=xlsread('4.xlsx');
data=num;
a=2:1:23;
plot(a,data(:,2));
xlabel('站点编号')
ylabel('站点乘客平均延误/min');
title('9月10日 嘉定104路公交 上/下行 站点乘客平均延误')
set(gca,'YLim',[0 15]);
hold on;
plot(a,data(:,3));
legend('上行','下行');
set(gca,'XTick',[2:1:23]);
set(gca,'XTickLabel',{'2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23'});
set(gca,'YLim',[4 12]);
set(gca,'YTick',[4:1:12]);